#Generated by Fabric Compiler ( version 2020.3 <build 62942> ) at Wed Apr 20 12:04:57 2022

add_design "F:/pds_project/ConvKing/source/top.v"
add_constraint "F:/pds_project/ConvKing/ConvKing.fdc"
add_design "F:/pds_project/ConvKing/source/Bridge/axi/aq_axi_master.v"
add_design "F:/pds_project/ConvKing/source/Camera/cmos_8_16bit.v"
add_design "F:/pds_project/ConvKing/source/Camera/cmos_write_req_gen.v"
add_design "F:/pds_project/ConvKing/source/Camera/frame_fifo_read.v"
add_design "F:/pds_project/ConvKing/source/Camera/frame_fifo_write.v"
add_design "F:/pds_project/ConvKing/source/Camera/frame_read_write.v"
add_design "F:/pds_project/ConvKing/source/Camera/lut_ov5640_rgb565_1024_768.v"
add_design "F:/pds_project/ConvKing/source/Camera/i2c_master/i2c_config.v"
add_design "F:/pds_project/ConvKing/source/Camera/i2c_master/i2c_master_bit_ctrl.v"
add_design "F:/pds_project/ConvKing/source/Camera/i2c_master/i2c_master_byte_ctrl.v"
add_design "F:/pds_project/ConvKing/source/Camera/i2c_master/i2c_master_defines.v"
add_design "F:/pds_project/ConvKing/source/Camera/i2c_master/i2c_master_top.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/color_bar.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/video_define.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/video_timing_data.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/dvi_encoder.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/encode.v"
add_design "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/serdes_4b_10to1.v"
add_design "F:/pds_project/ConvKing/source/Uart/uart_rx.v"
add_design "F:/pds_project/ConvKing/source/Uart/uart_top.v"
add_design "F:/pds_project/ConvKing/source/Uart/uart_tx.v"
add_design "F:/pds_project/ConvKing/source/mult_add.v"
add_design F:/pds_project/ConvKing/ipcore/video_pll/video_pll.idf
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/color_bar.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/video_define.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/video_timing_data.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/dvi_encoder.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/encode.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Hdmi/dvi_tx/serdes_4b_10to1.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/dvi_tx/dvi_encoder.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/dvi_tx/encode.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/dvi_tx/serdes_4b_10to1.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/color_bar.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/video_define.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Hdmi/video_timing_data.v"
add_design F:/pds_project/ConvKing/ipcore/ddr3_core/ddr3_core.idf
add_design F:/pds_project/ConvKing/ipcore/afifo_16i_64o_512/afifo_16i_64o_512.idf
add_design F:/pds_project/ConvKing/ipcore/afifo_64i_16o_128/afifo_64i_16o_128.idf
add_design F:/pds_project/ConvKing/ipcore/mult_add_gen/mult_add_gen.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
synthesize -synplify_pro -selected_syn_tool_opt 1 -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force F:/pds_project/ConvKing/ipcore/ddr3_core/ddr3_core.idf
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/aq_axi_master.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ddr3.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_apb_reset_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_reset_ctrl_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_top_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_dll_update_ctrl_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_reset_ctrl_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_training_ctrl_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_update_ctrl_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_phy_io_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_phy_top_v1_1.v"
add_design "F:/pds_project/ConvKing/source/Bridge/ddr3/pll_50_400_v1_1.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design F:/pds_project/ConvKing/ipcore/ddr3_core/ddr3_core.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Peripheral/key.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/key_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ddr3.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/aq_axi_master.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_apb_reset_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_reset_ctrl_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrc_top_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_dll_update_ctrl_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_reset_ctrl_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_training_ctrl_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_ddrphy_update_ctrl_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_phy_io_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/ipsl_hmic_h_phy_top_v1_1.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Bridge/ddr3/pll_50_400_v1_1.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Accelerator/ReLU/relu.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/ReLU/relu_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_anchor.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_cal.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_coturn.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Linear/linear.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Linear/linear_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/mobilenet_invres.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/mobilenet_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/yolo_aft.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/yolo_CBL.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/yolo_mobilenet.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/yolo_pre.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/yolo_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design F:/pds_project/ConvKing/ipcore/uart_fifo/uart_fifo.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Peripheral/bmp_read.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/sd_card_bmp.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Sdcard/sd_card_cmd.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Sdcard/sd_card_sec_read_write.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Sdcard/sd_card_top.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/Sdcard/spi_master.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Peripheral/ax_debounce.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "F:/pds_project/ConvKing/source/Peripheral/sd_card_bmp.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Peripheral/bmp_read.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/pt_read.v"
add_design "F:/pds_project/ConvKing/source/Peripheral/sd_card_weight.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design F:/pds_project/ConvKing/ipcore/afifo_32i_64o_256depth/afifo_32i_64o_256depth.idf
add_design F:/pds_project/ConvKing/ipcore/afifo_64i_32o_128depth/afifo_64i_32o_128depth.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force F:/pds_project/ConvKing/ipcore/uart_fifo/uart_fifo.idf
remove_design -force F:/pds_project/ConvKing/ipcore/afifo_32i_64o_256depth/afifo_32i_64o_256depth.idf
remove_design -force F:/pds_project/ConvKing/ipcore/afifo_64i_32o_128depth/afifo_64i_32o_128depth.idf
add_design F:/pds_project/ConvKing/ipcore/afifo_32i_8o_64depth/afifo_32i_8o_64depth.idf
add_design F:/pds_project/ConvKing/ipcore/afifo_8i_32o_64depth/afifo_8i_32o_64depth.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_buffer.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_search.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_top.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_anchor.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_coturn.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_cal.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_top.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_buffer.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_search.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_buffer.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_search.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/temp/conv_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design F:/pds_project/ConvKing/ipcore/DebugCore/DebugCore.idf
add_design F:/pds_project/ConvKing/ipcore/JtagCore/JtagCore.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
add_design "F:/pds_project/ConvKing/source/Uart/uart_decode.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/defines_kind.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
remove_design -force -verilog "F:/pds_project/ConvKing/source/defines_kind.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_dic.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_distance.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_img.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_result.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/color_det_top.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/max.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/rgb2hsv.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/hsv2rgb.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_design F:/pds_project/ConvKing/ipcore/histogram_ram/histogram_ram.idf
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/max.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/KNN/histogram.v"
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram/histogram_ram.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram/histogram_ram.idf
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram/histogram_ram.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_r/histogram_ram_r.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_g/histogram_ram_g.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_b/histogram_ram_b.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram_r/histogram_ram_r.idf
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram_g/histogram_ram_g.idf
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram_b/histogram_ram_b.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_r/histogram_ram_r.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_g/histogram_ram_g.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_b/histogram_ram_b.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram_r/histogram_ram_r.idf
remove_design F:/pds_project/ConvKing/ipcore/histogram_ram_g/histogram_ram_g.idf
remove_design -force F:/pds_project/ConvKing/ipcore/histogram_ram_b/histogram_ram_b.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_h/histogram_ram_h.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_s/histogram_ram_s.idf
add_design F:/pds_project/ConvKing/ipcore/histogram_ram_v/histogram_ram_v.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_dic_tb.v"
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_distance_tb.v"
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_img_tb.v"
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_result_tb.v"
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_top_tb.v"
add_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/hist_top_tb.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_top.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_search.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/temp/conv_buffer.v"
remove_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_img_tb.v"
remove_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_distance_tb.v"
remove_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_dic_tb.v"
remove_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_result_tb.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_img.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_top.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_dic.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_distance.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/knn_result.v"
remove_design -force F:/pds_project/ConvKing/ipcore/DebugCore/DebugCore.idf
remove_design -force F:/pds_project/ConvKing/ipcore/JtagCore/JtagCore.idf
remove_simulation "F:/pds_project/ConvKing/source/Accelerator/KNN/tb/knn_top_tb.v"
remove_design -verilog "F:/pds_project/ConvKing/source/Accelerator/KNN/hsv2rgb.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_buffer.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_cal.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_search.v"
add_design "F:/pds_project/ConvKing/source/Accelerator/Conv/conv_top.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/Linear/linear_top.v"
remove_design -force -verilog "F:/pds_project/ConvKing/source/Accelerator/ReLU/relu_top.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -force F:/pds_project/ConvKing/ipcore/afifo_8i_32o_64depth/afifo_8i_32o_64depth.idf
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
